app/controllers/mentors_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = 3 LIMIT 1
---
  def show
		@allcourses = Course.paginate(:page => params[:courses_page], :per_page => 6)
    @mentor = current_user
    @courses = Course.where(:user_id => @mentor.id).paginate(:page => params[:mycourse_page], :per_page => 6)

INSERT INTO "courses" ("capacity", "created_at", "description", "location", "name", "price", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def createCourse
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save