app/controllers/students_controller.rb

SELECT "enrollments".* FROM "enrollments" WHERE "enrollments"."user_id" = 4
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."user_id" = 25
SELECT "courses".* FROM "courses"
---
  def show
    @student = current_user
    my_enrollments = Enrollment.where(:user_id => @student.id)
    my_courses = []
    my_enrollments.each do |e|
      my_courses << Course.find(e.course_id)
    end
    @my_courses = my_courses
		my_line_items = LineItem.where(:user_id => @student.id)
		my_cart = []
		@total_price = 0
    my_line_items.each do |e|
			course = Course.find(e.course_id)
      my_cart << course
			@total_price += course.price
    end
		@my_cart = my_cart
    @courses = Course.all

INSERT INTO "enrollments" ("course_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["course_id", nil], ["created_at", Thu, 07 Nov 2013 06:57:32 UTC +00:00], ["updated_at", Thu, 07 Nov 2013 06:57:32 UTC +00:00], ["user_id", 4]]
---
  def addCourse(course_id)
    enrollment = Enrollment.create(:course_id => course_id, :user_id => current_user.id)