app/controllers/users_controller.rb

  def addMentor
    current_user.roles << Role.where(:name => :mentor).first
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'mentor' LIMIT 1

  def addStudent
    current_user.roles << Role.where(:name => :student).first
---
SELECT "roles".* FROM "roles" WHERE "roles"."name" = 'student' LIMIT 1